## Pandas

### pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language.

<b><br>Get Data 
<br>Prepare Data 
<br>Analyze Data 
<br>Present Data</b>

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.read_excel('student_marks.xls')# reading an excel sheet

In [3]:
data

        Name  Science  Maths
0   Student1       45     78
1   Student2       56     89
2   Student3       78     45
3   Student4       69     56
4   Student5       85     69
5  student23       10     23

In [4]:
# extracting data from excel sheet
Name = data['Name'].values
Science = data['Science'].values
Maths = data['Maths'].values
print('Name :', Name)
print('Science :',Science)
print('Maths :',Maths)

Name : ['Student1' 'Student2' 'Student3' 'Student4' 'Student5' 'student23']
Science : [45 56 78 69 85 10]
Maths : [78 89 45 56 69 23]

In [11]:
# finding sum horizontal axis and transposing the matrix
Total = np.sum([[Science],[Maths]],axis=0).T
Total

array([[123],
       [145],
       [123],
       [125],
       [154],
       [ 33]])

In [6]:
#editing the excel sheet
data.insert(loc=3,column='Total',value=Total)

In [7]:
data

        Name  Science  Maths  Total
0   Student1       45     78    123
1   Student2       56     89    145
2   Student3       78     45    123
3   Student4       69     56    125
4   Student5       85     69    154
5  student23       10     23     33

In [12]:
#saving output to new excel sheet
data.to_excel('output.xls')

In [9]:
#displaying the output
op=pd.read_excel('output.xls')
op

        Name  Science  Maths  Total
0   Student1       45     78    123
1   Student2       56     89    145
2   Student3       78     45    123
3   Student4       69     56    125
4   Student5       85     69    154
5  student23       10     23     33